300/case305/AllrunParallel.org
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=`getApplication`

runApplication blockMesh
runApplication topoSet
runApplication subsetMesh -overwrite c0 -patch floatingObject
cp -r 0.org 0 > /dev/null 2>&1
runApplication setFields

#runApplication $application

runApplication decomposePar
runParallel $(getApplication) 8
runApplication reconstructPar

# ----------------------------------------------------------------- end-of-file
